{"_id":"44a7ec0d62f48ba3","cid":"b5a69b144ebf343e","tid":"56560b727d0aec86","did":"00003d02e039d3bf","city":"Chatan Cho","state":"Okinawa","country":"JP","c":"Apple Service","d":"Repair service / customer support services such as Apple iOS product Job Description As Apple Authorized Service Provider, we started accepting repair of Apple products. Servicing of Apple products (Presence or absence of trauma, such as confirmation of warranty) Reception (1) repair (Use the diagnostic tools) diagnosis and (2) Checking the symptoms And parts replacement and (3) restoration process Registration (4) repair content Product targeted, iPhone, iPad, iPod. Or contact us by phone Guest would be detrimental to the Apple product of your customers it is coming to a store to shop, and I would like to ask the symptoms of troubled, perform diagnosis and recovery in accordance with the customers. Because there is the training that I did well in the Shin-Yokohama headquarters, (accommodation and transportation expenses paid at the time of training) Please apply with confidence Service companies Apple Service Okinawa / Chatan shop Work location Nakagami-gun, Okinawa Chatan-cho, Nakagami-gun, Chatan Chatan-cho 2-7-3> map Nearest station Okinawa City Monorail Station paleo Okinawa City Monorail City Hospital before station Length of service Three months or more - long-term ※ There is a trial period. (2 months) Holiday, vacation Shift system Working hours (1)10:30~19:30 (2)11:00~20:00 [Qualifications] Welcome that you can work on Saturdays, Sundays, and holidays Those who can work about 5 days a week Part-time worker, married welcome Those who can PC simple operation Welcome versatile in working hours Person warm welcome can be English! [Location] For the \"Apple Products Services Okinawa / Chatan store\" is being renovated and will be working in the \"Apple product service Naha / new downtown store\" until the end of July. (: No. 1 No. 1, Naha, Okinawa Mekaru 2-chome address) ※ I perform in the \"Apple Service Naha / new downtown store\" is the acceptance of the application Experience and qualifications High school graduate or more No experience OK Treatment and benefits Uniform lending There is social insurance system Workers' compensation equipped Yes training There employee discount There are paid and bonuses (in accordance with the provisions) (Up to 30,000 yen a month) transportation expenses paid (Some have self-pay parking Badai) car commuting Allowed [Training] Location: Shin-Yokohama Headquarters (Yokohama City, Kanagawa Prefecture) Period: about one week ※ Accommodation ... transportation costs are paid in full!","t":"Reception, IT · Creative, Technical Support","sites":["Baitoru dot-com"],"dates":["2014-05-09"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"dawgs":["international","ds3","jobposting","geo_named","match"],"mentions":[]}
{"_id":"154425f983575df8","cid":"ec5d6dc33d344da1","tid":"031528e80663c37a","did":"00004be190e6aa60","city":"London","state":"England","country":"GB","c":"ASOS","d":"The role: Junior Graphic Designer, Menswear Where is it based: Greater London House, Mornington Crescent, London The hours: 9.00am – 5.30pm (Monday to Thursday), 9.00am – 5.00pm (Friday) The Story so far… ASOS burst on to the scene in 2000 and hasn’t looked back. We are the UK’s number one fashion and beauty destination, and as a recent survey showed, we are the second most visited fashion website on the planet. With over 60,000 product lines across womenswear, menswear, footwear, accessories, jewellery and beauty, we’re setting the pace in a worldwide fashion revolution. With around 1,500 new product lines being introduced each week, we’re ambitious and we certainly know our stuff. We ship to 237 countries and also have specific sites targeting the USA, France, Germany, Italy, Australia, Russia and China, with offices in London, Sydney, New York, France and Germany and China. This is all part of our strategy, which we call ASOS Future. Our ambition is to be the world’s no.1 online fashion brand for 20-somethings, having set ourselves a target to reach £1bn annual sales by 2015. Therefore it is really important to us that we continue to attract top talent across the globe to help us realise our goals. If you’re looking for an opportunity to go places and really take your career forward, we could be the perfect fit for you! The ASOS Way We do things a certain way - The ASOS Way. It’s our DNA and runs through every single thing we do here - it defines who we are, what we do and how we do it. Some things change, these don’t. We are Passionate; we are proud to be a part of ASOS, we always give our best and we celebrate our successes. We are Customer Obsessed; we know our customers love fashion and we understand what they want, we know our stuff inside and out, we put our customers at the heart of everything we do. We Restlessly Innovate; we don’t stand still, we give it a go and we’re brave. We are Collaborative and Respectful; We work together to get the job done, we grow ideas from within, we make things happen and we do the right thing. People are the future of our business and we have really big ideas. We know we need people who can turn these ideas into reality – it’s our people that make the difference. A bit about the Team: The creative team sits within the MW content team, and the wider Customer Experience team. The creative team works hand in hand with the editorial, marketing and project teams and works closely with international content, social, retail, UX and tech teams. We are a growing team of highly experienced online editors and creatives. Our role is to create daily news, style and entertainment content, assets for homepage promotion, social, newsletters and PR lookbooks for ASOS that is highly engaging and will meet our 20-something audience’s practical and emotional needs. We are focused on originality and honesty and committed to understanding our audience, constantly evolving our proposition to be known as pioneers in the editorial industry. The key focus will be to support the Creative Manager and Senior Designers on producing unique and fresh design and photography executions across all online collateral including – website homepages, online promotions, landing pages, online editorial features, blogs, newsletters, social media, affiliate banners. You will be a true brand guardian ensuring that all touch points are protected and are inline with the creative vision. An interest in fashion is an advantage. You will have good layout, typography skills and experience in a digital design environment, ideally with an online retailer. A good understanding and demonstrated skills with UI/UX is also useful. You will be producing highly stylish and directional design and photography so previous experience with a fashion/lifestyle brand or design agency is essential. Your design skills and styles are extremely versatile and you are flexible and happy to work in a fast changing environment. You will have a BA/HND or equivalent in graphic/web design and an outstanding portfolio. You’ll have great attention to detail, be driven and willing to adapt to change and go the extra mile. You’ll be diplomatic, be forthcoming with ideas and initiatives, enthusiastic and a team player and a first class communicator able to speak to different people in a variety of departments. The Role: Responsibilities include but are not limited to: Design and execution of creative projects as briefed Understand creative vision of department as directed by Creative Manager Actively aware of all areas of design across fashion, trends, lifestyle and brands Be a source of inspiration by bringing new ideas and concepts to work Support colleagues Actively responsive to fluctuating business workloads Contribute to other team member’s workload as directed Raise workload/resource issues Ensuring all web projects are executed within time line and schedule Develop and maintain excellent relationships with all other departments Work with Editorial, Photography, Marketing and Trade teams to design and deliver excellent visual site imagery with quality and performance. Create visual designs that effectively communicate seasonal concepts and brand identity, as well as the design and production of screen layouts, colour palettes, interface elements, iconography, typography, style guides, etc. Assisting the MW Daily team on all stories that require shooting, liaising with and assisting photographer to execute Making selects of imagery, working with retouchers and artworking assets for each story / social post Work with the daily and social teams to introduce new ways to present ASOS MW Creating assets where directed for social, daily and site and mobile imagery Assisting across the creative team where directed What Success Looks Like: Delivery of required performance levels and KPIs Aspirational and on brand assets and creative Delivery of assets and work to deadlines as agreed Skills and experience you will need: Experience Previous experience of and preference for working internationally Previous retail experience desirable but not essential. Experience working in fashion or a proven interest desirable Skills Highly creative Mac literate Fully conversant in Adobe CS5 (InDesign/Illustrator/Photoshop) Knowledge of Flash advantageous Excellent verbal and written communication We really love hearing from you but before applying please ask yourself the following… Is this role a good match for the direction I’d like to take my career in? We want to really know why you have chosen this career. Do I have all the skills and experience required for this role? Be realistic. We will only consider applications that demonstrate relevant skills or the potential to match the role requirements. Spell Check. As simple as it sounds make sure your application is to the highest standard. You will be surprised at how many people apply with spelling mistakes on them.","t":"Junior Graphic Designer, Menswear","sites":["ASOS"],"dates":["2014-11-20"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"duns":"220033463","c_u":"asos.com","revenue":1672330160,"employees":1627,"c_tech_hits":47,"dawgs":["duns","international","match","geo_named","jobposting","tech_hits","url","ds3"],"mentions":[]}
{"_id":"ae56e18e308f5e4c","cid":"c94b3108a5bb710a","tid":"bdc2427a2b2a443b","did":"00006d233139329e","city":"Sydney","state":"NSW","country":"AU","c":"TRA Global","d":"The role is working as a Websphere Developer on a major integration project with a one of the largest insurance companies using IBM Websphere and Legacy. The Main requirements for this role are: 3+ years commercial Java, Spring and MVC Software Development experience At least 6 months IBM Websphere Portal experience, ideally v8 MVC MS SQL Automated Unit Testing Agile experience with Scrum Desired skills are: more than a years experience with: Message broker MQ series Websphere Portal Server The role is to start immediately and on a 6 month contract (with potential to be extended to 12 months). If this sounds like you please send an application through to tim.d@tra-global.com SK9945A","t":"Websphere Developer (6 Month Contact)","sites":["TRA Global"],"dates":["2015-02-04"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"dawgs":["staff","international","geo_named","jobposting","ds3"],"mentions":[]}
{"_id":"4c221b6a826c9312","cid":"da649cfd1ef1fa1e","tid":"e0a6e8c0684b788c","did":"0000de5fea1f8d83","city":"Warwick","state":"England","country":"GB","c":"IBM","d":"Job description This is an opportunity to join one of SAP’s leading partners for Enterprise Performance Management and Business Intelligence. It’s a chance to be part of an expanding team, working at the leading edge of the SAP industry. What’s more, it’s a position that will enable you to voice your opinion and put into practice what you know is right. Required: As well as a degree-level qualification, exceptional consulting skills and a talent for managing stakeholders, you’ll need the following: Experience of SAP BPC (Microsoft and/or NetWeaver versions) and/or SAP Business Objects BI solutions across a minimum of two complete project lifecycles Experience of underlying technologies (SQL Server, SAP BW and/or SAP ECC) Experience of gathering requirements and designing BPC or Business Objects solutions Experience of BPC implementations (including building applications, writing input schedules, configuring logic, loading data, security and configuring reports) and some or all aspects of SAP Business Objects BI and data integration solutions Knowledge of planning and/or consolidation systems.Preferred: This is a role in which every day presents a new challenge. So, in addition to the skills listed above, you’re going to need a commitment to innovation, passion for your work and the ambition to learn and develop. An expert knowledge of general data warehousing and business intelligence will be an advantage too. Required Bachelor's Degree Experience of SAP BPC or SAP Business Objects BI solutions across a minimum of two complete project lifecycles : Mastered Eligibility to work in the UK : Mastered English: Fluent IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.","t":"SAP BPC Consultant","sites":["IBM"],"dates":["2014-10-13"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"dawgs":["international","negative","geo_named","jobposting","ds3"],"mentions":[]}
{"_id":"4ba3cddc329347cb","cid":"35cc3c908cbdca0f","tid":"80c2427185bd9aca","did":"00013af364fbd21d","city":"Kilmarnock","state":"Scotland","country":"GB","c":"QA Apprenticeships","d":"Successful IT company are looking to recruit a number of IT apprentices to join their Scottish office based in Kilmarnock.This unique company are leaders in their field and offer a fantastic training ground for their apprentices. An award winning, Ofsted outstanding apprenticeship from QA - 94% go onto full-time jobs. Job Specification The company are looking for people who have a genuine interest in IT, they want the ideal candidate to be able to show that IT is not just a subject studied at school or college but a hobby for them. They want to recruit apprentices who are trying to learn in their own time as well as through study in college/school. This is a fantastic apprenticeship opportunity and you will learn skills that will set you up well to have a very successful career in IT. The Apprenticeship role will include: Learn company’s IT system Installing Hardware Fixing hardware Fault finding Provide general IT support Skills required for this apprenticeship: Wide IT knowledge as demonstrated by relevant qualifications A quick learner who responds well to new tasks Well organised and able to work with a high degree of accuracy Dependable, self-motivated and able to work independently Good team player who can work productively with colleagues Positive and enthusiastic Experience of working in a similar role is advantageous but not essential as training will be provided in this entry level position Qualifications required: Scotland - You must have at least 5 standard grades at level 1-3, or equivalent, including Maths and English Training to be provided: Scotland - Systems & Networking Apprenticeship Level 3 - | (MCSA) in Windows 7 Configuration | Interconnecting Cisco Networking Devices Part 1 | Diploma for Information Technology & Telecommunications Professionals SCQF Level 6 Apprenticeship duration : 12 months Working week: 37.5 hours (Monday – Friday, 9 – 5:30) About QA apprenticeships: QA Apprenticeships is an Ofsted Outstanding provider of IT apprenticeships. 94% of QA Apprentices secure permanent employment after finishing their IT apprenticeship. Multi-award winning – Apprenticeship Programme of the Year 2012, 2013 & 2014, Microsoft UK Partner of the Year 2013 Special Commendation – and the first IT apprenticeships business rated Ofsted Outstanding in all areas. Future prospects: 94% of QA Apprentices secure permanent employment after finishing their IT apprenticeship. Additionally may be opportunities to undertake further learning such as Higher apprenticeships.It only takes a minute to apply for an IT apprenticeship with QA and begin your IT career with great prospects today. For more information about QA Apprenticeships, please visit our website. Note: This advert may close early if a suitable candidate is found before the advertised close date is reached.","t":"IT Systems Apprenticeship","sites":["QA Apprenticeships"],"dates":["2014-10-23"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"dawgs":["staff","international","geo_named","jobposting","ds3"],"mentions":[]}
{"_id":"6d172b22ce6145fc","cid":"b4f9272226cc3887","tid":"a2bb8d3122cc0578","did":"000165280e0f264c","city":"Jiangning Qu","state":"Jiangsu Sheng","country":"CN","c":"Nanjing Exabyte Valley Computer Technology Co., Ltd.","d":"Industry: Computer Software Experience: 5 years Type: Foreign (European and American) Education: Bachelor Size: 11-50 Staff Salary: Negotiable Responsible for research and development of large-scale cloud-based Internet, mobile computing network service system; Job requirements: 1: the need for more than five years of practical work experience, do not vote resume does not meet the conditions; 2: There are superb java programming and web development ability, not the ability of those who do not vote resume; 3: There is a large system architecture practical experience and ability; 4: Familiar Linux, Windows operating systems, database systems and network systems; 5: Good English reading and writing skills; 6: Good communication skills; 7: Good leadership and teamwork; Computer Science or other engineering degree or above, there is a master's degree preferred","t":"R & D Manager","sites":["If the neighbor network"],"dates":["2014-09-26"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"dawgs":["international","ds3","jobposting","geo_named","match"],"mentions":[]}
{"_id":"9da1c117dfc14646","cid":"3bed744f9e888ed3","tid":"9431fa4e6488392c","did":"0001af0559f5491c","city":"Bellshill","state":"Scotland","country":"GB","c":"Edge Testing","d":"Due to the continued business growth, Edge Testing Solutions are looking to appoint a full time Office Administrator to be based at our head office at Strathclyde Business Park, Bellshill. This position offers the right candidate an outstanding opportunity to join a dynamic business with competitive salary and excellent prospects for career development. In return we seek a hardworking, motivated individual who bring a positive and flexible approach with the drive and initiative to achieve. With proven skills in office administration, you will preferably have previous experience of having worked in a client based environment delivering outstanding levels of service to both internal and external customers. This is a full time position requiring some flexibility to work extended hours during peak periods of work. The role will encompass aspects of the following: · To ensure that financial records are collated, processed and filed consistently and in a timely way · Dealing with all aspects of financial administration including customer invoices, customer receipts, supplier invoices, supplier payments, expenses, bank reconciliation, payroll preparation, timesheets, credit control and all associated monthly reporting · General office administration including purchases, stationery, filing and office security · To provide administrative support for Training courses and events · To coordinate training events, including making bookings, coordinating booking forms and joining instructions, prepare training materials. · To provide HR administration including associate contracts, staff on boarding, referencing, induction activities. Required skills include: · Previous experience of working successfully in a finance/accounts based role · Excellent administration skills, strong numeracy skills · Highest level of attention to detail · Ability to work in a fast paced, busy, professional environment · Strong organisational skills with excellent multi-tasking approach · Effective verbal and written communication skills · Excellent IT skills with proven skills in MS Excel and Word, experience of Sage would be an advantage · Looking to work in a challenging role within a growing and dynamic business Location – the role will be based from our Bellshill office. Edge Testing Solutions is a leading independent software testing provider based in the UK. Founded in 2007, Edge Testing Solutions has quickly built up a very strong reputation as a market leading provider of software testing solutions, renowned for our ethos and culture of doing good business. This goes to the very heart of the organisation and doing good business for us means that we do everything to the best of our ability and the right way by our people, our clients, our suppliers, our industry and the environment. We innovate and provide new offerings to support the requirements of our customers and to meet market trends. We have experience across many industry sectors including financial services, telecommunications and media, utilities, manufacturing and distribution, retail and the public sector. We offer an independent, specialist view of testing: • A complete testing solutions portfolio aligned to the Edge Testing Framework • Flexible engagement models, including our unique, Active Testing Model • Solutions based on business benefit •Technology to support our solutions through our partnership with HP Software and our own range of products","t":"Office Administrator","sites":["Jobcentre Plus Universal Jobmatch"],"dates":["2014-11-26"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"dawgs":["international","ds3","jobposting","geo_named","match"],"mentions":[]}
{"_id":"76a77164c075dd22","cid":"895311881a561250","tid":"03dfd6d6e2797066","did":"0001e97354f34a0b","city":"Sanya","state":"Hainan","country":"CN","c":"Hilton (Hilton Worldwide)","d":"TM Kitchen Commis2 Chef kitchen staff cook pasta division two ( Job Number: HUM012J9 ) Work Location : Hilton Sanya Resort and Spa Yalong Bay National Resort District Sanya 572000 A Human Resources Coordinator with Hilton Hotels and Resorts will support Human Resource related activities including recruitment, learning and development and training, performance management, compensation and benefits, and employee relations initiatives. What will it be like to work for this Hilton Brand? One of the most recognized names in the industry, Hilton Hotels & Resorts offers travelers a world of authentic experiences. The brand continues to be the innovative, forward-thinking global leader of hospitality. With products and services that meet the needs of tomorrow's savvy global travelers, we shape experiences in which every Guest feels cared for, valued, and respected. If you understand the importance of upholding a brand’s reputation and value the effort it takes to provide a globally recognized hospitality experience, you may be just the person we are looking for to work as a Team Member with Hilton Hotels & Resorts. Because it’s with Hilton Hotels & Resorts where we promise an exceptional Guest experience every time. What will I be doing? As a Human Resources Coordinator, you are responsible for all Human Resources Team Member related activities. These activities include recruitment, learning and development and training, performance management, compensation & benefits, employee relations, health and safety, and other team-based activities. Specifically, a Human Resources Coordinator will perform the following tasks to the highest standards: Initiate recruitment activities using Taleo, the Company's talent management system Input data into the hotel payroll system and communicate with payroll to ensure accuracy Manage all Human Resource administration and onboarding activities Support Human Resources activities, including onboarding, work experience program, careers fairs, training materials, and Team Member opinion surveys Serve as the point of contact for Team Member issues, advising the Human Resources Director as appropriate Keep current with employment law, human resources policies, and training requirements Assist in determining training requirements and support training initiatives Assist in the organization of Team Member social events What are we looking for? A Human Resources Coordinator serving Hilton Worldwide Brand hotels and vacations are always working on behalf of our Guests and working with other Team Members. To successfully fill this role, you should maintain the attitude, behaviors, skills, and values that follow: Previous experience in customer service Strong administration and communication skills Demonstrated attention to detail, while multi-tasking and delivering work on time Ability to work productively despite multiple interruptions Demonstrated trust and confidentiality as a member of the Human Resources Team A passion and enthusiasm to be part of a winning team Proficiency, at an intermediate level, with computers and computer programs, including Microsoft programs Tertiary qualifications, or other collegiate-level degree, in Training or Human Resources, preferred What benefits will I receive? Your benefits will include a competitive starting salary and holiday entitlement. As an employee you will become a member of the The Hilton Club which provides reduced hotel room rates in our hotels worldwide, plus discounts on products and services offered by Hilton Worldwide and its partners. We look forward to explaining in detail the range of excellent benefits that you would expect from a global hotel organization like Hilton Worldwide. Learn more now about Hilton Hotels & Resorts --- the global leader of hospitality. More than 500 locations and nearly 200,000 rooms across six continents Innovations include: pioneering the airport hotel concept, becoming the first coast-to-coast hotel chain in the US, and the first to install televisions in Guest ooms Flagship brand of Hilton Worldwide with properties in more than 77 countries More than 70 world-class resorts and more nearly 200 full-service spas Harris Poll EquiTrend®, Brand of the Year - Full Service Hotel for 2010 and 2011 Number one global brand awareness in the hospitality industry Job : Human Resources and Training Schedule : Full-time","t":"TM Kitchen Commis2 Chef kitchen staff cook pasta division two","sites":["Hilton Worldwide"],"dates":["2014-11-13"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"dawgs":["international","ds3","jobposting","geo_named","match"],"mentions":[]}
{"_id":"723b07fa6d40fd97","cid":"2560795cf6018a3c","tid":"41002530e41328c8","did":"000201741ede83c5","city":"Mandaluyong","state":"Calabarzon","country":"PH","c":"YWA HUMAN RESOURCE CORPORATION (FORMERLY YANGWHA)","d":"SAIPAN PROJECT, Northern Mariana Islands Expires on: Jan 2, 2015 Agency Information Agency Name: YWA HUMAN RESOURCE CORPORATION (FORMERLY YANGWHA) POEA License No.: 214-LB-111110-R Address: 1268 General Luna St., Ermita, Manila (Near LRT UN Station) Manila, Metro Manila Tel. No.: 524-7777/ 524-2181/ 524-2185 View Complete Agency Profile Qualifications Gender: Male/Female Age: 25 - 45 years old Education: at least Bachelor's / College Degree Experience: 3 year(s) For manpower pooling only. No fees to be collected during the application process. Mag-ingat sa illegal recruiter. Advisory Jobs advertised at WorkAbroad.ph are posted directly by the recruitment agencies. All transactions are between you and the recruitment agency. Read our guidelines to avoid illegal recruitment. How to Apply How to Register Job Information - PAYROLL SUPERVISOR Principal/Project: YWA HUMAN RESOURCE, CNMI CORPORATION Job Description and Requirements YWA HUMAN RESOURCE, CNMI CORPORATION SAIPAN PROJECT MANPOWER POOLING ONLY Qualifications: With at least 3 years overseas experience on the same trade. 25-45 years old. Preferably with experience in Hotel. YWA HUMAN RESOURCE CORP. #1268 GENERAL LUNA ST., ERMITA, MANILA TEL. 5247777; 5242181 EMAIL: recruitment@ywacorp.com, aireen@ywacorp.com, marygil@ywacorp.com, donna@ywacorp.com, glein @ywacorp.com POEA LICENSE # 214-LB-111110-R | 2009 POEA TOP PERFORMER AWARDEE | ISO 9001:2008 CERTIFIED BEWARE OF ILLEGAL RECRUITERS. NO FEES TO BE COLLECTED. FOR MANPOWER POOLING ONLY. Refer to a Friend View Similar Jobs Save this Job Other Jobs from this Agency OFW News Living Simply SSS to Launch New Contact Center for OFWs There Are No Secrets to Getting a Job Abroad Cebu Pacific will fly to Kuwait, Australia and 5 others PAL can now fly to Guam Share Us On: Download WorkAbroad App: Apple App Store Google Play Store Job Information - PAYROLL SUPERVISOR Principal/Project: YWA HUMAN RESOURCE, CNMI CORPORATION Job Description and Requirements YWA HUMAN RESOURCE, CNMI CORPORATION SAIPAN PROJECT MANPOWER POOLING ONLY Qualifications: With at least 3 years overseas experience on the same trade. 25-45 years old. Preferably with experience in Hotel. YWA HUMAN RESOURCE CORP. #1268 GENERAL LUNA ST., ERMITA, MANILA TEL. 5247777; 5242181 EMAIL: recruitment@ywacorp.com, aireen@ywacorp.com, marygil@ywacorp.com, donna@ywacorp.com, glein @ywacorp.com POEA LICENSE # 214-LB-111110-R | 2009 POEA TOP PERFORMER AWARDEE | ISO 9001:2008 CERTIFIED BEWARE OF ILLEGAL RECRUITERS. NO FEES TO BE COLLECTED. FOR MANPOWER POOLING ONLY.","t":"Payroll Supervisor","sites":["workabroad.ph"],"dates":["2014-10-01"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"dawgs":["staff","international","geo_named","jobposting","ds3"],"mentions":[]}
{"_id":"3fbd1c8c69dbbb29","cid":"6535fb8282b5710a","tid":"75a7d9ff2343fc86","did":"00024f386df6308b","city":"Hitachiomiya-shi","state":"Ibaraki","country":"JP","c":"Corporation headquarters Shikeru","d":"[8] working hours 1,100 yen spray work 20's to 40's men active in painting business in [New inexperienced person welcome!] Airbrush [salary] hourly rate: 30 ~ 17: 30 [holiday] Sat ... Sun ... holiday experience! take advantage of, more than 1,000 yen per hour,day shift, five-day workweek, transportation expenses paid [Location] Ibaraki Hitachi Omiya registration meeting held Reservations required! On you have a resume, please! Feel free to come Location / Create, Omiya Center July 22 (Tuesday) 9:30 to 11:30 [Employment] [Dispatch] job profession system, profession system other, [py1] [star0] [photo1]","t":"Painting Business","sites":["Job journal net"],"dates":["2014-07-18"],"ds":3,"c_lang":{"latin":100},"doc_lang":{"latin":100},"dawgs":["international","ds3","jobposting","geo_named","match"],"mentions":[]}